---
kind: type
id: T:Autodesk.Revit.DB.ImportColorMode
source: html/a56dc03e-053b-769e-ad25-c76a9c8f0e5d.htm
---
# Autodesk.Revit.DB.ImportColorMode

An enumerated type listing how colors are handled in an import process.

## Syntax (C#)
```csharp
public enum ImportColorMode
```